function App() {
  return (
    <>
      <div>
        <h1>Virtual DOM</h1>
        <p>ვირტუალური დომი გამოიყენება ახალ ფრეიმვორქებში მად: რეაქთში. ვირტუალური დომი არის რეალური დომის ასლი. მაგ: ჩვენ გვაქვს წიგნის ასლი და ტექსტი შევცვალეთ. ეს არის კარგი რადგან მთლიანი ვებ გვერდის შემოწმებას და დახატვას ჯობს ერთი ელემენტი შევცვალოთ რაც უფრო სწრაფია.</p>
        <h1>Render</h1>
        <p>render არის ფუნქცია რომელიც გამოაჩენს ელემენტებს მთელ ვებსაიტზე მას გადაეცემა ელემენტების ადრე ეს ძალიან რთულად ხდებოდა მაგრამ ახლა უფრო გაამარტივეს.</p>
        <h1>jsx</h1>
        <p>jsx ანუ javascript XML. ამაში არის გაერთიანებული html, css და js. აქ არის გამარტივებული კოდის წერის სტილი. რასაც დავწერთ შიგნით გადაიქცევა ერთ ხაზ ჯავასკრიპტ კოდში რასაც ბაბელი აკეთებს.</p>
      </div>
    </>
  )
}

export default App
